tap "anomalyco/tap"
tap "sdkman/tap"
brew "gradle"
brew "kotlin"
brew "ktlint"
brew "lazygit"
brew "mole"
brew "neovim"
brew "node"
brew "opencode"
brew "openjdk@21"
brew "pipenv"
brew "pnpm"
brew "pre-commit"
brew "ruby-build"
brew "rbenv"
brew "tmux"
brew "wget"
brew "sdkman/tap/sdkman-cli"
cask "cursor-cli"
cask "dbeaver-community"
cask "figma"
cask "firefox"
cask "intellij-idea"
cask "iterm2"
cask "rectangle"
cask "visual-studio-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "redhat.java"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "xdebug.php-debug"
