tap "sdkman/tap"
brew "kotlin"
brew "ktlint"
brew "lazygit"
brew "neovim"
brew "node"
brew "openjdk@21"
brew "pre-commit"
brew "ruby-build"
brew "rbenv"
brew "sdkman/tap/sdkman-cli"
cask "claude"
cask "cursor"
cask "dbeaver-community"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "font-ubuntu-mono-nerd-font"
cask "intellij-idea"
cask "iterm2"
cask "postman"
cask "rectangle"
cask "sublime-text"
vscode "fwcd.kotlin"
vscode "vscodevim.vim"
