tap "homebrew/bundle"
tap "sdkman/tap"
brew "gradle"
brew "kotlin"
brew "ktlint"
brew "lazygit"
brew "mole"
brew "neovim"
brew "node"
brew "openjdk@21"
brew "pipenv"
brew "pnpm"
brew "pre-commit"
brew "ruby-build"
brew "rbenv"
brew "tmux"
brew "wget"
brew "sdkman/tap/sdkman-cli"
cask "cursor-cli"
cask "dbeaver-community"
cask "figma"
cask "firefox"
cask "intellij-idea"
cask "iterm2"
cask "rectangle"
